//=======================================================================
//							基本設定
//
//	出席番号 45	
//	山崎 聖矢
//=======================================================================
#ifndef _COMMON_H_
#define _COMMON_H_

#define SCREEN_WIDTH (1280)				//クライアントの幅	1280
#define SCREEN_HEIGHT (720)				//クライアントの高さ 720

//=====================================================
//構造体宣言
//=====================================================
typedef struct
{
	float x;
	float y;
	float z;
}Float3;

#endif
