#include "input.h"

//=====================================================
//グローバル変数
//=====================================================
static float g_Stick_y = 0;

//=====================================================
//初期化
//=====================================================
void Joycon_Init(void)
{
	g_Stick_y = 0.0f;
}

//=====================================================
//ジョイコン操作
//=====================================================
int Joycon_Operator(void)
{
	//右回転
	if (Keyboard_IsPress(DIK_RIGHTARROW))
	{
		g_Stick_y++;
	}
	//左回転
	else if (Keyboard_IsPress(DIK_LEFTARROW))
	{
		g_Stick_y--;
	}
	return g_Stick_y;
}