#include "input.h"
#include "dinput.h"
#include "JoyInput.h"

//=====================================================
//マクロ定義
//=====================================================
#define STICK_SPEED (1.0f)

//=====================================================
//グローバル変数
//=====================================================
static float g_stick_y = 0;

//=====================================================
//初期化
//=====================================================
void Joycon_Init(void)
{
	g_stick_y = 0.0f;
}

//=====================================================
//ジョイコン操作
//=====================================================
float Joycon_Operator(void)
{
	//スティック操作
	g_stick_y += GetStick().x / 500;

	//デバッグ用回転
#if (DEBUG) || (_DEBUG)
	if (Keyboard_IsPress(DIK_LEFTARROW))
	{
		g_stick_y -= STICK_SPEED;
	}
	else if (Keyboard_IsPress(DIK_RIGHTARROW))
	{
		g_stick_y += STICK_SPEED;
	}
#endif	(DEBUG) || (_DEBUG)

	return g_stick_y;
}

//=====================================================
//回転量リセット
//=====================================================
void Joycon_Reset(void)
{
	g_stick_y = 0.0f;
}