#include "input.h"
#include "dinput.h"

//=====================================================
//グローバル変数
//=====================================================
static float g_stick_y = 0;

//=====================================================
//初期化
//=====================================================
void Joycon_Init(void)
{
	g_stick_y = 0.0f;
}

//=====================================================
//ジョイコン操作
//=====================================================
int Joycon_Operator(void)
{
	//右回転
	if (Keyboard_IsPress(DIK_RIGHTARROW))
	{
		g_stick_y++;
	}
	//左回転
	else if (Keyboard_IsPress(DIK_LEFTARROW))
	{
		g_stick_y--;
	}
	return g_stick_y;
}

//=====================================================
//回転量リセット
//=====================================================
void Joycon_Reset(void)
{
	g_stick_y = 0.0f;
}