#include "sprite.h"
#include "texture.h"

//=====================================================
//グローバル変数
//=====================================================
unsigned int g_tex[4] = {};

//=====================================================
//初期化
//=====================================================
void Pow_Gauge_Init(void)
{
	g_tex[0] = Texture_SetLoadFile("Texture\\HP_Gauge_bg.png", 256, 32);		//黒背景
	g_tex[1] = Texture_SetLoadFile("Texture\\HP_Gauge_01_green.png", 256, 32);	//ゲージ
	g_tex[2] = Texture_SetLoadFile("Texture\\HP_Gauge_01_frame.png", 256, 32);	//ゲージ枠
}

//=====================================================
//終了
//=====================================================
void Pow_Gauge_Uninit(void)
{

}

//=====================================================
//更新
//=====================================================
void Pow_Gauge_Update(void)
{

}

//=====================================================
//描画
//=====================================================
void Pow_Gauge_Draw(void)
{
	Sprite_Draw(g_tex[0], 0, 10);
	Sprite_Draw(g_tex[1], 0, 10);
	Sprite_Draw(g_tex[2], 0, 10);
}